magic-square-generation/README.org
I am looking for a job now and my last six months have been more devops focused. Let's get back into some coding

For this I just asked Mistral to cook me up a simple problem, here's what it gave me

* Problem Statement

In a magic square, all of the numbers from =1= to =n^2= appear, and the sums of the numbers in any row, column, or diagonal are always equal. Given an integer ~n (1 <= n <= 9)~, write a function that creates an
and returns such a magic square for the given size.

Here is an example of a =3x3= magic square:
#+begin_quote
[8, 1, 6]
[3, 5, 7]
[4, 9, 2]
#+end_quote


Create a function called =magicSquare= that takes in an integer =n= and returns a 2D list representing the magic square for the given size.

** Example:
#+begin_src python :eval no
magic_square(3) == [[8, 1, 6], [3, 5, 7], [4, 9, 2]]
#+end_src

** Constraints:
- The function should be able to handle any valid input from =1 to 9=.
- Use only basic data structures and built-in functions (avoid external libraries).


