magic-square-generation/README.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<!-- 2025-05-01 Thu 22:16 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>&lrm;</title>
<meta name="author" content="George Mauer" />
<meta name="generator" content="Org Mode" />

</head>
<body>
<div id="content" class="content">
<div id="table-of-contents" role="doc-toc">
<h2>Table of Contents</h2>
<div id="text-table-of-contents" role="doc-toc">
<ul>
<li><a href="#org11ef109">1. Problem Statement</a>
<ul>
<li><a href="#org987427c">1.1. Example:</a></li>
<li><a href="#orgaba57cb">1.2. Constraints:</a></li>
</ul>
</li>
<li><a href="#org29c0e86">2. Brainstorming</a></li>
<li><a href="#org09b8f3c">3. Python Solution</a>
<ul>
<li><a href="#org76d8dd7">3.1. Naive Attempt 1</a></li>
<li><a href="#orgbb3ac8e">3.2. Attempt 2 - Constraint Solver</a>
<ul>
<li><a href="#org7d9aaed">3.2.1. Brainstorming</a></li>
</ul>
</li>
</ul>
</li>
</ul>
</div>
</div>
<p>
I am looking for a job now and my last six months have been more devops focused. Let's get back into some coding
</p>

<p>
For this I just asked Mistral to cook me up a simple problem, here's what it gave me
</p>
<div id="outline-container-org11ef109" class="outline-2">
<h2 id="org11ef109"><span class="section-number-2">1.</span> Problem Statement</h2>
<div class="outline-text-2" id="text-1">
<p>
In a magic square, all of the numbers from <code>1</code> to <code>n^2</code> appear, and the sums of the numbers in any row, column, or diagonal are always equal. Given an integer <code>n (1 &lt;= n &lt;= 9)</code>, write a function that creates an
and returns such a magic square for the given size.
</p>

<p>
Here is an example of a <code>3x3</code> magic square:
</p>
<blockquote>
<p>
[8, 1, 6]
[3, 5, 7]
[4, 9, 2]
</p>
</blockquote>


<p>
Create a function called <code>magicSquare</code> that takes in an integer <code>n</code> and returns a 2D list representing the magic square for the given size.
</p>
</div>
<div id="outline-container-org987427c" class="outline-3">
<h3 id="org987427c"><span class="section-number-3">1.1.</span> Example:</h3>
<div class="outline-text-3" id="text-1-1">
<div class="org-src-container">
<pre class="src src-python"><span style="color: #2aa1ae; font-weight: bold;">magic_square</span><span style="color: #4f97d7;">(</span><span style="color: #a45bad;">3</span><span style="color: #4f97d7;">)</span> <span style="color: #4f97d7; font-weight: bold;">==</span> <span style="color: #4f97d7;">[</span><span style="color: #bc6ec5;">[</span><span style="color: #a45bad;">8</span>, <span style="color: #a45bad;">1</span>, <span style="color: #a45bad;">6</span><span style="color: #bc6ec5;">]</span>, <span style="color: #bc6ec5;">[</span><span style="color: #a45bad;">3</span>, <span style="color: #a45bad;">5</span>, <span style="color: #a45bad;">7</span><span style="color: #bc6ec5;">]</span>, <span style="color: #bc6ec5;">[</span><span style="color: #a45bad;">4</span>, <span style="color: #a45bad;">9</span>, <span style="color: #a45bad;">2</span><span style="color: #bc6ec5;">]</span><span style="color: #4f97d7;">]</span>
</pre>
</div>
</div>
</div>
<div id="outline-container-orgaba57cb" class="outline-3">
<h3 id="orgaba57cb"><span class="section-number-3">1.2.</span> Constraints:</h3>
<div class="outline-text-3" id="text-1-2">
<ul class="org-ul">
<li>The function should be able to handle any valid input from <code>1 to 9</code>.</li>
<li>Use only basic data structures and built-in functions (avoid external libraries).</li>
</ul>
</div>
</div>
</div>
