magic-square-generation/README.html
<div id="outline-container-org29c0e86" class="outline-2">
<h2 id="org29c0e86"><span class="section-number-2">2.</span> Brainstorming</h2>
<div class="outline-text-2" id="text-2">
<p>
A quick Google seems to indicate that magic squares are always possible, or at least possible enough that I think the constraints of the problem make sense. Sounds like there's "simple" techniques to do it. Maybe I'll look into those for a second implementation after I do this one.
</p>

<p>
I also want to use python because eh, it keeps coming up lately. I'll probably use elisp later.
</p>

<p>
Now what do we actually do? Well, a depth first search seems like the obvious thing, right?
</p>

<p>
In fact we know what the sum of every span (column, row, diagonal) in the square must be - it must be <code>sum(1..n^2)/n</code> which for a 3-quare would be <code>45/3=15</code>. We could shortcut the DFS process by picking a number, then checking if that forces the sum of any spans to exceed it.
</p>

<p>
Additionally we <b>could</b> set a lower bound as well. If you are in a 3-square row that already contains a <code>1</code> then a <code>2</code> is out of the question since there would be no way to get to <code>15</code> with that. We could generalize it as a branch being a dead end if the row's current sum <code>sum(span)</code> plus the highest values possible in the remaining cells (<code>sum(n, n-1, n-2)</code> <code>n-len(span) times</code>) is less than our <code>Target</code> from above. This is good to know but feels more complicated thatn it might be worth within our constraints so lets punt on it.
</p>

<p>
Now, what sort of datastructure would be good here? What comes to mind is a 2d structure comprised of linked lists so that you can easily get the current spans as we go. Even though I'm picturing actually putting values into cells, it is probably best that this thing be immutable just because that works better for the detph first search, right? Lets write down the sort of operations we want to be able to do easily:
</p>

<div class="org-src-container">
<pre class="src src-python"><span style="color: #7590db;">new_square</span> <span style="color: #4f97d7; font-weight: bold;">=</span> <span style="color: #4f97d7; font-weight: bold;">set</span><span style="color: #4f97d7;">(</span>square, <span style="color: #bc6ec5;">row</span><span style="color: #4f97d7; font-weight: bold;">=</span><span style="color: #a45bad;">0</span>, <span style="color: #bc6ec5;">column</span><span style="color: #4f97d7; font-weight: bold;">=</span><span style="color: #a45bad;">2</span>, <span style="color: #bc6ec5;">value</span><span style="color: #4f97d7; font-weight: bold;">=</span><span style="color: #a45bad;">7</span><span style="color: #4f97d7;">)</span>
</pre>
</div>
<p>
and the check for sums would be something like this
</p>

<p>
This seems like a good idea at first for an api
</p>
<div class="org-src-container">
<pre class="src src-python"><span style="color: #4f97d7; font-weight: bold;">if</span> <span style="color: #4f97d7; font-weight: bold;">any</span><span style="color: #4f97d7;">(</span><span style="color: #bc6ec5;">(</span>target_sum <span style="color: #4f97d7; font-weight: bold;">!=</span> <span style="color: #4f97d7; font-weight: bold;">sum</span><span style="color: #2d9574;">(</span>span<span style="color: #2d9574;">)</span> <span style="color: #4f97d7; font-weight: bold;">for</span> <span style="color: #7590db;">span</span> <span style="color: #4f97d7; font-weight: bold;">in</span> <span style="color: #2aa1ae; font-weight: bold;">get_spans</span><span style="color: #2d9574;">(</span>new_square, <span style="color: #bc6ec5;">row</span><span style="color: #4f97d7; font-weight: bold;">=</span><span style="color: #a45bad;">0</span>, <span style="color: #bc6ec5;">column</span><span style="color: #4f97d7; font-weight: bold;">=</span><span style="color: #a45bad;">2</span><span style="color: #2d9574;">)</span><span style="color: #bc6ec5;">)</span><span style="color: #4f97d7;">)</span>:
    <span style="color: #4f97d7; font-weight: bold;">return</span>
</pre>
</div>

<p>
but wait, that's not quite right, a span that isn't filled out yet isn't going to be the right sum but is not a dead end either. So I guess we could delegate the whole thing to the set function so it would be impossible to enter an invalid state. <code>try_set</code> instead of <code>set</code> and return <code>True</code> or <code>False</code> as to whether it succeeded. That would be easy enough to check so long as we have some sort of <code>undefined</code> token we could ignore (or coerce to 0 which works for the purposes of summing).
</p>

<p>
Finally I want to think about the structure. We really do need immutability I feel unless we want to be really invested in fastidiously cleaning up after each and every depth first search. Now normally I would say that some sort of copy-on-write implementation is what we want, but in this case we're simply storing integers. Copy-on-write would typically work by storing references to the "immutable" bits but that would just be references which aren't any smaller on the stack than integers are, right? I'm sure there's stuff you can do to make improvements here but at such small <code>n</code> it just doesn't seem like such a big deal to copy all the numbers in our square on each <code>try_set()</code>
</p>

<p>
&#x2014;
</p>

<p>
Ok, so that's one approach, lets just do a simple version of it. In fact, lets use my favorite approach of picturing ourselves physically on the problem space
</p>

<p>
I picture standing on a square grid with a book of available numbers. I tear down the page for the first number and pin it to the square, I then move forward and pin the next and I do this all the way across until I have pinned a number to each square. At that point I am done and I can check if it is a magic square. If it is, then hooray we did good; but, if not, then we must remove the last two notes and try things in a different order. Of course we know that this won't work but we can optimize in a bit. By repeating this process we will have successfully brute forced a solution.
</p>

<p>
Ok, but what about the optimization? Well it is important to understand that for a square of size <code>N</code>, each row, column, and diagonal must sum to
</p>

<p>
\[ \frac{N^2(N^2+1)}{2N} \] which can be simplified as \[ \frac{N(N^2+1)}{2} \] and represented as <code>T</code>
</p>

<p>
If we ever hit the following conditions then we can stop exploring as it is impossible to get a magic square from that state
</p>

<ul class="org-ul">
<li>a row, column, or diagonal with a <code>sum &gt; T</code></li>
<li>a completed row, column, or diagonal with a <code>sum != T</code></li>
</ul>

<p>
Furthermore, if we can assume move top left to bottom right, if a completed row does not <code>sum == T</code> then no variation of that row will work. You could say the same thing of the <code>/</code> diagonal and columns as well, but under this assumption you wouldn't complete any of these until the last row so it doesn't save you on all that much iterations.
</p>

<p>
Also, you know what? I want to push myself a bit, I have only passing experience with Pandas, and I know it implements copy-on-write semantics for <code>DataFrame</code> so - even though it might not be the most efficient, lets learn something and do this with pandas
</p>
</div>
</div>
<div id="outline-container-org09b8f3c" class="outline-2">
<h2 id="org09b8f3c"><span class="section-number-2">3.</span> Python Solution</h2>
<div class="outline-text-2" id="text-3">
</div>
