magic-square-generation/README.org
** Naive Attempt 1
:PROPERTIES:
:tangle-target: magic_square_generation_attempt_1.py
:END:
First some types and imports
#+begin_src python
  import pandas as pd
  import numpy as np
  from typing import Iterable
  from dataclasses import dataclass, field

  MagicSquareCells = pd.DataFrame

  @dataclass(frozen=True)
  class Position:
      row: int
      column: int
#+end_src

lets also build out a class for our magic square builder with some helper values set. Note that it's a ~Builder~ not a ~MagicSquare~ since we don't want it to be possible to create invalid objects (ie a magic square that is not actually magic)
#+begin_src python
  @dataclass(frozen=True)
  class MagicSquareBuilder:
      cells: MagicSquareCells
      side_size: int = field(init=False)
      max_span_sum: int = field(init=False)

      def __post_init__(self):
          object.__setattr__(self, 'side_size', self.cells.shape[0])
          # Using Godel's(?) equation for summing up sequential sequences / square_size
          object.__setattr__(self, 'max_span_sum', self.side_size*(1+self.side_size**2)/2)
#+end_src

We need a way to tell if a completed square is indeed magic, and that's going to be a bunch of our pandas stuff. I could make this stuff into methods on the class, but really its all in one module and typed so I see little point to it for the purposes of this exercise.

#+begin_src python
  def is_magic_square(square: MagicSquareBuilder) -> bool:
      row_sums = square.cells.sum(axis=1)
      first_row_sum = row_sums.iloc[0]
      all_rows_equal = (row_sums == first_row_sum).all()
      if not all_rows_equal:
          return False
      col_sums = square.cells.sum(axis=0)
      all_cols_sum_same_as_rows = (col_sums == first_row_sum).all()
      if not all_cols_sum_same_as_rows:
          return False
      return first_row_sum == np.diag(square.cells.values).sum() == np.diag(np.fliplr(square.cells.values)).sum()
#+end_src
#+begin_src python :results output pp replace :tangle no
  print(is_magic_square(MagicSquareBuilder(cells=pd.DataFrame([[1,2],[3,4]])))) # should be false
  magic_square = MagicSquareBuilder(cells=pd.DataFrame([
      [8, 1, 6],
      [3, 5, 7],
      [4, 9, 2],
  ]) )
  print(is_magic_square(magic_square))# should be true
#+end_src

#+RESULTS:
: False
: True

Ok, that works well. Now we need a way of setting a new value in our builder. A ~try_set~ function will allow us to run some basic checks before setting a value into a new copy of the builder. We want to make sure we're creating new instances since otherwise we'd have to clean up when unwinding the stack. I also believe that pandas might have some optimization around copying that can serve us well. At the very least, I see an article discussing that in Pandas 3.0 (which I'm not on yet).

**Assumption**: Here we are counting on the assumption that movement is top left to bottom right and that any filled values are filled with =0=

#+begin_src python
  def _potential_span_sums(square: MagicSquareBuilder, position: Position) -> Iterable[int]:
      row, column = position
      yield square.cells.iloc[row, :].values.sum()
      yield square.cells.iloc[:, column].values.sum()

      # \ Diagonal (main diagonal)
      if row == column:
          yield np.diag(square.cells.values).sum()

      # / Diagonal (anti-diagonal)
      if row == square.side_size - column - 1:
          yield np.diag(np.fliplr(square.cells.values)).sum()

  def try_set(square: MagicSquareBuilder, position: Position, value: int) -> None | MagicSquareBuilder:
      """Return a new square with position set to the passed in value. This will
      do some basic checking to ensure that the returned square could potentially
      still be a magic square. If not it will return None.
      """

      span_sums = _potential_span_sums(square, position)
      if any((square.max_span_sum < (x + value)) for x in span_sums):
          return None

      new_cells = square.cells.copy()
      new_cells.iloc[*position] = value
      return MagicSquareBuilder(cells=new_cells)
#+end_src

Lets experiment with that one

#+begin_src python :results output pp replace :tangle no
  incomplete_square = MagicSquareBuilder(cells=pd.DataFrame(np.zeros((3, 3), dtype=int)))
  print(try_set(incomplete_square, (2, 1), 20)) #should be none
  print(try_set(incomplete_square, (0, 1), 1)) #should be fine
#+end_src

#+RESULTS:
: None
: MagicSquareBuilder(cells=   0  1  2
: 0  0  1  0
: 1  0  0  0
: 2  0  0  0, side_size=3, max_span_sum=15.0)


Ok, so now lets actually implement the depth first search where we move from position to position and try to set values, drilling down to the next level if setting succeeds

#+begin_src python
  remaining_recursions = 100000
  def fill_magic_square(square: None | MagicSquareBuilder, remaining_positions: list[Position], remaining_values_to_try: list[int]) -> None | MagicSquareBuilder:
      assert len(remaining_positions) == len(remaining_values_to_try)
      global remaining_recursions

      assert 0 < remaining_recursions
      remaining_recursions -= 1

      if not remaining_positions:
          return square if is_magic_square(square) else None

      position_to_set, *other_positions = remaining_positions

      for value in remaining_values_to_try:
          square_with_value = try_set(square, position_to_set, value)
          if not square_with_value:
              continue
          all_other_values_to_try = [v for v in remaining_values_to_try if v != value]
          filled_square_with_value = fill_magic_square(square_with_value, other_positions, all_other_values_to_try)
          if filled_square_with_value:
              return filled_square_with_value

      return None

  def find_magic_square(size: int) -> None | MagicSquareCells:
      # While prefilling with zeros is not technically correct and would in many situations be better
      # to use nan, when working specifically with magic squares it kind of doesn't matter and
      # prefilling with zeros is just more efficient
      square = MagicSquareBuilder(cells=pd.DataFrame(np.zeros((size, size), dtype=int)))
      positions = list((r, c) for r in range(size) for c in range(size))
      all_values = list(range(1, size**2+1))
      square = fill_magic_square(square, positions, all_values)
      return square and square.cells
#+end_src

Lets try it

#+begin_src python :results output pp replace :tangle no
  print(find_magic_square(2)) # should be None
  print(find_magic_square(3)) # sould be a square
#+end_src

#+RESULTS:
: None
:    0  1  2
: 0  2  7  6
: 1  9  5  1
: 2  4  3  8


Wahoo that works, its not the most efficient but it does work. Although I notice that it is taking forever and I hit timeouts even on values as low as 4

#+begin_src python
if __name__ == "__main__":
    import sys
    if len(sys.argv) > 1:
        find_magic_square(int(sys.argv[1]))
#+end_src

#+RESULTS:

#+begin_src shell :results verbose :var script_name=(org-entry-get (point) "tangle-target" 't)
  timeout 10s python $script_name 4 2>&1
  echo $?
#+end_src

#+RESULTS:
: 124

Ok, so what I did is just too damn slow even for our limited constraints. Perhaps we can try to speed it up. I'm not ready to blame this all on Pandas just yet

