magic-square-generation/README.html
<div id="outline-container-org76d8dd7" class="outline-3">
<h3 id="org76d8dd7"><span class="section-number-3">3.1.</span> Naive Attempt 1</h3>
<div class="outline-text-3" id="text-3-1">
<p>
First some types and imports
</p>
<div class="org-src-container">
<pre class="src src-python"><span style="color: #4f97d7; font-weight: bold;">import</span> pandas <span style="color: #4f97d7; font-weight: bold;">as</span> pd
<span style="color: #4f97d7; font-weight: bold;">import</span> numpy <span style="color: #4f97d7; font-weight: bold;">as</span> np
<span style="color: #4f97d7; font-weight: bold;">from</span> typing <span style="color: #4f97d7; font-weight: bold;">import</span> <span style="color: #ce537a; font-weight: bold;">Iterable</span>
<span style="color: #4f97d7; font-weight: bold;">from</span> dataclasses <span style="color: #4f97d7; font-weight: bold;">import</span> dataclass, field

<span style="color: #7590db; font-weight: bold;">MagicSquareCells</span> <span style="color: #4f97d7; font-weight: bold;">=</span> pd.<span style="color: #ce537a; font-weight: bold; font-style: italic;">DataFrame</span>

<span style="color: #4f97d7; font-weight: bold;">@</span><span style="color: #2aa1ae; font-weight: bold;">dataclass</span><span style="color: #4f97d7;">(</span><span style="color: #bc6ec5;">frozen</span><span style="color: #4f97d7; font-weight: bold;">=</span><span style="color: #4f97d7;">True</span><span style="color: #4f97d7;">)</span>
<span style="color: #4f97d7; font-weight: bold;">class</span> <span style="color: #ce537a; font-weight: bold;">Position</span>:
    <span style="color: #7590db;">row</span>: <span style="color: #4f97d7; font-weight: bold;">int</span>
    <span style="color: #7590db;">column</span>: <span style="color: #4f97d7; font-weight: bold;">int</span>
</pre>
</div>

<p>
lets also build out a class for our magic square builder with some helper values set. Note that it's a <code>Builder</code> not a <code>MagicSquare</code> since we don't want it to be possible to create invalid objects (ie a magic square that is not actually magic)
</p>
<div class="org-src-container">
<pre class="src src-python"><span style="color: #4f97d7; font-weight: bold;">@</span><span style="color: #2aa1ae; font-weight: bold;">dataclass</span><span style="color: #4f97d7;">(</span><span style="color: #bc6ec5;">frozen</span><span style="color: #4f97d7; font-weight: bold;">=</span><span style="color: #4f97d7;">True</span><span style="color: #4f97d7;">)</span>
<span style="color: #4f97d7; font-weight: bold;">class</span> <span style="color: #ce537a; font-weight: bold;">MagicSquareBuilder</span>:
    <span style="color: #7590db;">cells</span>: <span style="color: #ce537a; font-weight: bold;">MagicSquareCells</span>
    <span style="color: #7590db;">side_size</span>: <span style="color: #4f97d7; font-weight: bold;">int</span> <span style="color: #4f97d7; font-weight: bold;">=</span> <span style="color: #2aa1ae; font-weight: bold;">field</span><span style="color: #4f97d7;">(</span><span style="color: #bc6ec5;">init</span><span style="color: #4f97d7; font-weight: bold;">=</span><span style="color: #4f97d7;">False</span><span style="color: #4f97d7;">)</span>
    <span style="color: #7590db;">max_span_sum</span>: <span style="color: #4f97d7; font-weight: bold;">int</span> <span style="color: #4f97d7; font-weight: bold;">=</span> <span style="color: #2aa1ae; font-weight: bold;">field</span><span style="color: #4f97d7;">(</span><span style="color: #bc6ec5;">init</span><span style="color: #4f97d7; font-weight: bold;">=</span><span style="color: #4f97d7;">False</span><span style="color: #4f97d7;">)</span>

    <span style="color: #4f97d7; font-weight: bold;">def</span> <span style="color: #bc6ec5; font-weight: bold;">__post_init__</span><span style="color: #4f97d7;">(</span><span style="color: #4f97d7; font-weight: bold;">self</span><span style="color: #4f97d7;">)</span>:
        object.<span style="color: #2aa1ae; font-weight: bold; font-style: italic;">__setattr__</span><span style="color: #4f97d7;">(</span><span style="color: #4f97d7; font-weight: bold;">self</span>, <span style="color: #2d9574;">'side_size'</span>, <span style="color: #4f97d7; font-weight: bold;">self</span>.<span style="color: #a45bad; font-style: italic;">cells</span>.<span style="color: #a45bad; font-style: italic;">shape</span><span style="color: #bc6ec5;">[</span><span style="color: #a45bad;">0</span><span style="color: #bc6ec5;">]</span><span style="color: #4f97d7;">)</span>
        <span style="color: #2aa1ae; background-color: #292e34;"># Using Godel's(?) equation for summing up sequential sequences / square_size</span>
        object.<span style="color: #2aa1ae; font-weight: bold; font-style: italic;">__setattr__</span><span style="color: #4f97d7;">(</span><span style="color: #4f97d7; font-weight: bold;">self</span>, <span style="color: #2d9574;">'max_span_sum'</span>, <span style="color: #4f97d7; font-weight: bold;">self</span>.<span style="color: #a45bad; font-style: italic;">side_size</span><span style="color: #4f97d7; font-weight: bold;">*</span><span style="color: #bc6ec5;">(</span><span style="color: #a45bad;">1</span><span style="color: #4f97d7; font-weight: bold;">+</span><span style="color: #4f97d7; font-weight: bold;">self</span>.<span style="color: #a45bad; font-style: italic;">side_size</span><span style="color: #4f97d7; font-weight: bold;">**</span><span style="color: #a45bad;">2</span><span style="color: #bc6ec5;">)</span><span style="color: #4f97d7; font-weight: bold;">/</span><span style="color: #a45bad;">2</span><span style="color: #4f97d7;">)</span>
</pre>
</div>

<p>
We need a way to tell if a completed square is indeed magic, and that's going to be a bunch of our pandas stuff. I could make this stuff into methods on the class, but really its all in one module and typed so I see little point to it for the purposes of this exercise.
</p>

<div class="org-src-container">
<pre class="src src-python"><span style="color: #4f97d7; font-weight: bold;">def</span> <span style="color: #bc6ec5; font-weight: bold;">is_magic_square</span><span style="color: #4f97d7;">(</span><span style="color: #7590db;">square</span>: <span style="color: #ce537a; font-weight: bold;">MagicSquareBuilder</span><span style="color: #4f97d7;">)</span> -&gt; <span style="color: #4f97d7; font-weight: bold;">bool</span>:
    <span style="color: #7590db;">row_sums</span> <span style="color: #4f97d7; font-weight: bold;">=</span> square.<span style="color: #a45bad; font-style: italic;">cells</span>.<span style="color: #2aa1ae; font-weight: bold; font-style: italic;">sum</span><span style="color: #4f97d7;">(</span><span style="color: #bc6ec5;">axis</span><span style="color: #4f97d7; font-weight: bold;">=</span><span style="color: #a45bad;">1</span><span style="color: #4f97d7;">)</span>
    <span style="color: #7590db;">first_row_sum</span> <span style="color: #4f97d7; font-weight: bold;">=</span> row_sums.<span style="color: #a45bad; font-style: italic;">iloc</span><span style="color: #4f97d7;">[</span><span style="color: #a45bad;">0</span><span style="color: #4f97d7;">]</span>
    <span style="color: #7590db;">all_rows_equal</span> <span style="color: #4f97d7; font-weight: bold;">=</span> <span style="color: #4f97d7;">(</span>row_sums <span style="color: #4f97d7; font-weight: bold;">==</span> first_row_sum<span style="color: #4f97d7;">)</span>.<span style="color: #2aa1ae; font-weight: bold; font-style: italic;">all</span><span style="color: #4f97d7;">()</span>
    <span style="color: #4f97d7; font-weight: bold;">if</span> <span style="color: #4f97d7; font-weight: bold;">not</span> all_rows_equal:
        <span style="color: #4f97d7; font-weight: bold;">return</span> <span style="color: #4f97d7;">False</span>
    <span style="color: #7590db;">col_sums</span> <span style="color: #4f97d7; font-weight: bold;">=</span> square.<span style="color: #a45bad; font-style: italic;">cells</span>.<span style="color: #2aa1ae; font-weight: bold; font-style: italic;">sum</span><span style="color: #4f97d7;">(</span><span style="color: #bc6ec5;">axis</span><span style="color: #4f97d7; font-weight: bold;">=</span><span style="color: #a45bad;">0</span><span style="color: #4f97d7;">)</span>
    <span style="color: #7590db;">all_cols_sum_same_as_rows</span> <span style="color: #4f97d7; font-weight: bold;">=</span> <span style="color: #4f97d7;">(</span>col_sums <span style="color: #4f97d7; font-weight: bold;">==</span> first_row_sum<span style="color: #4f97d7;">)</span>.<span style="color: #2aa1ae; font-weight: bold; font-style: italic;">all</span><span style="color: #4f97d7;">()</span>
    <span style="color: #4f97d7; font-weight: bold;">if</span> <span style="color: #4f97d7; font-weight: bold;">not</span> all_cols_sum_same_as_rows:
        <span style="color: #4f97d7; font-weight: bold;">return</span> <span style="color: #4f97d7;">False</span>
    <span style="color: #4f97d7; font-weight: bold;">return</span> first_row_sum <span style="color: #4f97d7; font-weight: bold;">==</span> np.<span style="color: #2aa1ae; font-weight: bold; font-style: italic;">diag</span><span style="color: #4f97d7;">(</span>square.<span style="color: #a45bad; font-style: italic;">cells</span>.<span style="color: #a45bad; font-style: italic;">values</span><span style="color: #4f97d7;">)</span>.<span style="color: #2aa1ae; font-weight: bold; font-style: italic;">sum</span><span style="color: #4f97d7;">()</span> <span style="color: #4f97d7; font-weight: bold;">==</span> np.<span style="color: #2aa1ae; font-weight: bold; font-style: italic;">diag</span><span style="color: #4f97d7;">(</span>np.<span style="color: #2aa1ae; font-weight: bold; font-style: italic;">fliplr</span><span style="color: #bc6ec5;">(</span>square.<span style="color: #a45bad; font-style: italic;">cells</span>.<span style="color: #a45bad; font-style: italic;">values</span><span style="color: #bc6ec5;">)</span><span style="color: #4f97d7;">)</span>.<span style="color: #2aa1ae; font-weight: bold; font-style: italic;">sum</span><span style="color: #4f97d7;">()</span>
</pre>
</div>
<div class="org-src-container">
<pre class="src src-python"><span style="color: #4f97d7; font-weight: bold;">print</span><span style="color: #4f97d7;">(</span><span style="color: #2aa1ae; font-weight: bold;">is_magic_square</span><span style="color: #bc6ec5;">(</span><span style="color: #ce537a; font-weight: bold;">MagicSquareBuilder</span><span style="color: #2d9574;">(</span><span style="color: #bc6ec5;">cells</span><span style="color: #4f97d7; font-weight: bold;">=</span>pd.<span style="color: #ce537a; font-weight: bold; font-style: italic;">DataFrame</span><span style="color: #67b11d;">(</span><span style="color: #b1951d;">[</span><span style="color: #4f97d7;">[</span><span style="color: #a45bad;">1</span>,<span style="color: #a45bad;">2</span><span style="color: #4f97d7;">]</span>,<span style="color: #4f97d7;">[</span><span style="color: #a45bad;">3</span>,<span style="color: #a45bad;">4</span><span style="color: #4f97d7;">]</span><span style="color: #b1951d;">]</span><span style="color: #67b11d;">)</span><span style="color: #2d9574;">)</span><span style="color: #bc6ec5;">)</span><span style="color: #4f97d7;">)</span> <span style="color: #2aa1ae; background-color: #292e34;"># should be false</span>
<span style="color: #7590db;">magic_square</span> <span style="color: #4f97d7; font-weight: bold;">=</span> <span style="color: #ce537a; font-weight: bold;">MagicSquareBuilder</span><span style="color: #4f97d7;">(</span><span style="color: #bc6ec5;">cells</span><span style="color: #4f97d7; font-weight: bold;">=</span>pd.<span style="color: #ce537a; font-weight: bold; font-style: italic;">DataFrame</span><span style="color: #bc6ec5;">(</span><span style="color: #2d9574;">[</span>
    <span style="color: #67b11d;">[</span><span style="color: #a45bad;">8</span>, <span style="color: #a45bad;">1</span>, <span style="color: #a45bad;">6</span><span style="color: #67b11d;">]</span>,
    <span style="color: #67b11d;">[</span><span style="color: #a45bad;">3</span>, <span style="color: #a45bad;">5</span>, <span style="color: #a45bad;">7</span><span style="color: #67b11d;">]</span>,
    <span style="color: #67b11d;">[</span><span style="color: #a45bad;">4</span>, <span style="color: #a45bad;">9</span>, <span style="color: #a45bad;">2</span><span style="color: #67b11d;">]</span>,
<span style="color: #2d9574;">]</span><span style="color: #bc6ec5;">)</span> <span style="color: #4f97d7;">)</span>
<span style="color: #4f97d7; font-weight: bold;">print</span><span style="color: #4f97d7;">(</span><span style="color: #2aa1ae; font-weight: bold;">is_magic_square</span><span style="color: #bc6ec5;">(</span>magic_square<span style="color: #bc6ec5;">)</span><span style="color: #4f97d7;">)</span><span style="color: #2aa1ae; background-color: #292e34;"># should be true</span>
</pre>
</div>

<p>
Ok, that works well. Now we need a way of setting a new value in our builder. A <code>try_set</code> function will allow us to run some basic checks before setting a value into a new copy of the builder. We want to make sure we're creating new instances since otherwise we'd have to clean up when unwinding the stack. I also believe that pandas might have some optimization around copying that can serve us well. At the very least, I see an article discussing that in Pandas 3.0 (which I'm not on yet).
</p>

<p>
<b><b>Assumption</b></b>: Here we are counting on the assumption that movement is top left to bottom right and that any filled values are filled with <code>0</code>
</p>

<div class="org-src-container">
<pre class="src src-python"><span style="color: #4f97d7; font-weight: bold;">def</span> <span style="color: #bc6ec5; font-weight: bold;">_potential_span_sums</span><span style="color: #4f97d7;">(</span><span style="color: #7590db;">square</span>: <span style="color: #ce537a; font-weight: bold;">MagicSquareBuilder</span>, <span style="color: #7590db;">position</span>: <span style="color: #ce537a; font-weight: bold;">Position</span><span style="color: #4f97d7;">)</span> -&gt; <span style="color: #ce537a; font-weight: bold;">Iterable</span><span style="color: #4f97d7;">[</span><span style="color: #4f97d7; font-weight: bold;">int</span><span style="color: #4f97d7;">]</span>:
    <span style="color: #7590db;">row</span>, <span style="color: #7590db;">column</span> <span style="color: #4f97d7; font-weight: bold;">=</span> position
    <span style="color: #4f97d7; font-weight: bold;">yield</span> square.<span style="color: #a45bad; font-style: italic;">cells</span>.<span style="color: #a45bad; font-style: italic;">iloc</span><span style="color: #4f97d7;">[</span>row, :<span style="color: #4f97d7;">]</span>.<span style="color: #a45bad; font-style: italic;">values</span>.<span style="color: #2aa1ae; font-weight: bold; font-style: italic;">sum</span><span style="color: #4f97d7;">()</span>
    <span style="color: #4f97d7; font-weight: bold;">yield</span> square.<span style="color: #a45bad; font-style: italic;">cells</span>.<span style="color: #a45bad; font-style: italic;">iloc</span><span style="color: #4f97d7;">[</span>:, column<span style="color: #4f97d7;">]</span>.<span style="color: #a45bad; font-style: italic;">values</span>.<span style="color: #2aa1ae; font-weight: bold; font-style: italic;">sum</span><span style="color: #4f97d7;">()</span>

    <span style="color: #2aa1ae; background-color: #292e34;"># \ Diagonal (main diagonal)</span>
    <span style="color: #4f97d7; font-weight: bold;">if</span> row <span style="color: #4f97d7; font-weight: bold;">==</span> column:
        <span style="color: #4f97d7; font-weight: bold;">yield</span> np.<span style="color: #2aa1ae; font-weight: bold; font-style: italic;">diag</span><span style="color: #4f97d7;">(</span>square.<span style="color: #a45bad; font-style: italic;">cells</span>.<span style="color: #a45bad; font-style: italic;">values</span><span style="color: #4f97d7;">)</span>.<span style="color: #2aa1ae; font-weight: bold; font-style: italic;">sum</span><span style="color: #4f97d7;">()</span>

    <span style="color: #2aa1ae; background-color: #292e34;"># / Diagonal (anti-diagonal)</span>
    <span style="color: #4f97d7; font-weight: bold;">if</span> row <span style="color: #4f97d7; font-weight: bold;">==</span> square.<span style="color: #a45bad; font-style: italic;">side_size</span> <span style="color: #4f97d7; font-weight: bold;">-</span> column <span style="color: #4f97d7; font-weight: bold;">-</span> <span style="color: #a45bad;">1</span>:
        <span style="color: #4f97d7; font-weight: bold;">yield</span> np.<span style="color: #2aa1ae; font-weight: bold; font-style: italic;">diag</span><span style="color: #4f97d7;">(</span>np.<span style="color: #2aa1ae; font-weight: bold; font-style: italic;">fliplr</span><span style="color: #bc6ec5;">(</span>square.<span style="color: #a45bad; font-style: italic;">cells</span>.<span style="color: #a45bad; font-style: italic;">values</span><span style="color: #bc6ec5;">)</span><span style="color: #4f97d7;">)</span>.<span style="color: #2aa1ae; font-weight: bold; font-style: italic;">sum</span><span style="color: #4f97d7;">()</span>

<span style="color: #4f97d7; font-weight: bold;">def</span> <span style="color: #bc6ec5; font-weight: bold;">try_set</span><span style="color: #4f97d7;">(</span><span style="color: #7590db;">square</span>: <span style="color: #ce537a; font-weight: bold;">MagicSquareBuilder</span>, <span style="color: #7590db;">position</span>: <span style="color: #ce537a; font-weight: bold;">Position</span>, <span style="color: #7590db;">value</span>: <span style="color: #4f97d7; font-weight: bold;">int</span><span style="color: #4f97d7;">)</span> -&gt; <span style="color: #4f97d7;">None</span> <span style="color: #4f97d7; font-weight: bold;">|</span> <span style="color: #ce537a; font-weight: bold;">MagicSquareBuilder</span>:
    <span style="color: #9f8766;">"""Return a new square with position set to the passed in value. This will</span>
<span style="color: #9f8766;">    do some basic checking to ensure that the returned square could potentially</span>
<span style="color: #9f8766;">    still be a magic square. If not it will return None.</span>
<span style="color: #9f8766;">    """</span>

    <span style="color: #7590db;">span_sums</span> <span style="color: #4f97d7; font-weight: bold;">=</span> <span style="color: #2aa1ae; font-weight: bold;">_potential_span_sums</span><span style="color: #4f97d7;">(</span>square, position<span style="color: #4f97d7;">)</span>
    <span style="color: #4f97d7; font-weight: bold;">if</span> <span style="color: #4f97d7; font-weight: bold;">any</span><span style="color: #4f97d7;">(</span><span style="color: #bc6ec5;">(</span>square.<span style="color: #a45bad; font-style: italic;">max_span_sum</span> <span style="color: #4f97d7; font-weight: bold;">&lt;</span> <span style="color: #2d9574;">(</span>x <span style="color: #4f97d7; font-weight: bold;">+</span> value<span style="color: #2d9574;">)</span><span style="color: #bc6ec5;">)</span> <span style="color: #4f97d7; font-weight: bold;">for</span> <span style="color: #7590db;">x</span> <span style="color: #4f97d7; font-weight: bold;">in</span> span_sums<span style="color: #4f97d7;">)</span>:
        <span style="color: #4f97d7; font-weight: bold;">return</span> <span style="color: #4f97d7;">None</span>

    <span style="color: #7590db;">new_cells</span> <span style="color: #4f97d7; font-weight: bold;">=</span> square.<span style="color: #a45bad; font-style: italic;">cells</span>.<span style="color: #2aa1ae; font-weight: bold; font-style: italic;">copy</span><span style="color: #4f97d7;">()</span>
    new_cells.<span style="color: #a45bad; font-style: italic;">iloc</span><span style="color: #4f97d7;">[</span><span style="color: #4f97d7; font-weight: bold;">*</span>position<span style="color: #4f97d7;">]</span> <span style="color: #4f97d7; font-weight: bold;">=</span> value
    <span style="color: #4f97d7; font-weight: bold;">return</span> <span style="color: #ce537a; font-weight: bold;">MagicSquareBuilder</span><span style="color: #4f97d7;">(</span><span style="color: #bc6ec5;">cells</span><span style="color: #4f97d7; font-weight: bold;">=</span>new_cells<span style="color: #4f97d7;">)</span>
</pre>
</div>

<p>
Lets experiment with that one
</p>

<div class="org-src-container">
<pre class="src src-python"><span style="color: #7590db;">incomplete_square</span> <span style="color: #4f97d7; font-weight: bold;">=</span> <span style="color: #ce537a; font-weight: bold;">MagicSquareBuilder</span><span style="color: #4f97d7;">(</span><span style="color: #bc6ec5;">cells</span><span style="color: #4f97d7; font-weight: bold;">=</span>pd.<span style="color: #ce537a; font-weight: bold; font-style: italic;">DataFrame</span><span style="color: #bc6ec5;">(</span>np.<span style="color: #2aa1ae; font-weight: bold; font-style: italic;">zeros</span><span style="color: #2d9574;">(</span><span style="color: #67b11d;">(</span><span style="color: #a45bad;">3</span>, <span style="color: #a45bad;">3</span><span style="color: #67b11d;">)</span>, <span style="color: #bc6ec5;">dtype</span><span style="color: #4f97d7; font-weight: bold;">=</span>int<span style="color: #2d9574;">)</span><span style="color: #bc6ec5;">)</span><span style="color: #4f97d7;">)</span>
<span style="color: #4f97d7; font-weight: bold;">print</span><span style="color: #4f97d7;">(</span><span style="color: #2aa1ae; font-weight: bold;">try_set</span><span style="color: #bc6ec5;">(</span>incomplete_square, <span style="color: #2d9574;">(</span><span style="color: #a45bad;">2</span>, <span style="color: #a45bad;">1</span><span style="color: #2d9574;">)</span>, <span style="color: #a45bad;">20</span><span style="color: #bc6ec5;">)</span><span style="color: #4f97d7;">)</span> <span style="color: #2aa1ae; background-color: #292e34;">#should be none</span>
<span style="color: #4f97d7; font-weight: bold;">print</span><span style="color: #4f97d7;">(</span><span style="color: #2aa1ae; font-weight: bold;">try_set</span><span style="color: #bc6ec5;">(</span>incomplete_square, <span style="color: #2d9574;">(</span><span style="color: #a45bad;">0</span>, <span style="color: #a45bad;">1</span><span style="color: #2d9574;">)</span>, <span style="color: #a45bad;">1</span><span style="color: #bc6ec5;">)</span><span style="color: #4f97d7;">)</span> <span style="color: #2aa1ae; background-color: #292e34;">#should be fine</span>
</pre>
</div>


<p>
Ok, so now lets actually implement the depth first search where we move from position to position and try to set values, drilling down to the next level if setting succeeds
</p>

<div class="org-src-container">
<pre class="src src-python"><span style="color: #7590db;">remaining_recursions</span> <span style="color: #4f97d7; font-weight: bold;">=</span> <span style="color: #a45bad;">100000</span>
<span style="color: #4f97d7; font-weight: bold;">def</span> <span style="color: #bc6ec5; font-weight: bold;">fill_magic_square</span><span style="color: #4f97d7;">(</span><span style="color: #7590db;">square</span>: <span style="color: #4f97d7;">None</span> <span style="color: #4f97d7; font-weight: bold;">|</span> <span style="color: #ce537a; font-weight: bold;">MagicSquareBuilder</span>, <span style="color: #7590db;">remaining_positions</span>: list<span style="color: #bc6ec5;">[</span><span style="color: #ce537a; font-weight: bold;">Position</span><span style="color: #bc6ec5;">]</span>, <span style="color: #7590db;">remaining_values_to_try</span>: list<span style="color: #bc6ec5;">[</span><span style="color: #4f97d7; font-weight: bold;">int</span><span style="color: #bc6ec5;">]</span><span style="color: #4f97d7;">)</span> -&gt; <span style="color: #4f97d7;">None</span> <span style="color: #4f97d7; font-weight: bold;">|</span> <span style="color: #ce537a; font-weight: bold;">MagicSquareBuilder</span>:
    <span style="color: #4f97d7; font-weight: bold;">assert</span> <span style="color: #4f97d7; font-weight: bold;">len</span><span style="color: #4f97d7;">(</span>remaining_positions<span style="color: #4f97d7;">)</span> <span style="color: #4f97d7; font-weight: bold;">==</span> <span style="color: #4f97d7; font-weight: bold;">len</span><span style="color: #4f97d7;">(</span>remaining_values_to_try<span style="color: #4f97d7;">)</span>
    <span style="color: #4f97d7; font-weight: bold;">global</span> remaining_recursions

    <span style="color: #4f97d7; font-weight: bold;">assert</span> <span style="color: #a45bad;">0</span> <span style="color: #4f97d7; font-weight: bold;">&lt;</span> remaining_recursions
    <span style="color: #7590db;">remaining_recursions</span> <span style="color: #4f97d7; font-weight: bold;">-=</span> <span style="color: #a45bad;">1</span>

    <span style="color: #4f97d7; font-weight: bold;">if</span> <span style="color: #4f97d7; font-weight: bold;">not</span> remaining_positions:
        <span style="color: #4f97d7; font-weight: bold;">return</span> square <span style="color: #4f97d7; font-weight: bold;">if</span> <span style="color: #2aa1ae; font-weight: bold;">is_magic_square</span><span style="color: #4f97d7;">(</span>square<span style="color: #4f97d7;">)</span> <span style="color: #4f97d7; font-weight: bold;">else</span> <span style="color: #4f97d7;">None</span>

    <span style="color: #7590db;">position_to_set</span>, <span style="color: #4f97d7; font-weight: bold;">*</span>other_positions <span style="color: #4f97d7; font-weight: bold;">=</span> remaining_positions

    <span style="color: #4f97d7; font-weight: bold;">for</span> <span style="color: #7590db;">value</span> <span style="color: #4f97d7; font-weight: bold;">in</span> remaining_values_to_try:
        <span style="color: #7590db;">square_with_value</span> <span style="color: #4f97d7; font-weight: bold;">=</span> <span style="color: #2aa1ae; font-weight: bold;">try_set</span><span style="color: #4f97d7;">(</span>square, position_to_set, value<span style="color: #4f97d7;">)</span>
        <span style="color: #4f97d7; font-weight: bold;">if</span> <span style="color: #4f97d7; font-weight: bold;">not</span> square_with_value:
            <span style="color: #4f97d7; font-weight: bold;">continue</span>
        <span style="color: #7590db;">all_other_values_to_try</span> <span style="color: #4f97d7; font-weight: bold;">=</span> <span style="color: #4f97d7;">[</span>v <span style="color: #4f97d7; font-weight: bold;">for</span> <span style="color: #7590db;">v</span> <span style="color: #4f97d7; font-weight: bold;">in</span> remaining_values_to_try <span style="color: #4f97d7; font-weight: bold;">if</span> v <span style="color: #4f97d7; font-weight: bold;">!=</span> value<span style="color: #4f97d7;">]</span>
        <span style="color: #7590db;">filled_square_with_value</span> <span style="color: #4f97d7; font-weight: bold;">=</span> <span style="color: #2aa1ae; font-weight: bold;">fill_magic_square</span><span style="color: #4f97d7;">(</span>square_with_value, other_positions, all_other_values_to_try<span style="color: #4f97d7;">)</span>
        <span style="color: #4f97d7; font-weight: bold;">if</span> filled_square_with_value:
            <span style="color: #4f97d7; font-weight: bold;">return</span> filled_square_with_value

    <span style="color: #4f97d7; font-weight: bold;">return</span> <span style="color: #4f97d7;">None</span>

<span style="color: #4f97d7; font-weight: bold;">def</span> <span style="color: #bc6ec5; font-weight: bold;">find_magic_square</span><span style="color: #4f97d7;">(</span><span style="color: #7590db;">size</span>: <span style="color: #4f97d7; font-weight: bold;">int</span><span style="color: #4f97d7;">)</span> -&gt; <span style="color: #4f97d7;">None</span> <span style="color: #4f97d7; font-weight: bold;">|</span> <span style="color: #ce537a; font-weight: bold;">MagicSquareCells</span>:
    <span style="color: #2aa1ae; background-color: #292e34;"># While prefilling with zeros is not technically correct and would in many situations be better</span>
    <span style="color: #2aa1ae; background-color: #292e34;"># to use nan, when working specifically with magic squares it kind of doesn't matter and</span>
    <span style="color: #2aa1ae; background-color: #292e34;"># prefilling with zeros is just more efficient</span>
    <span style="color: #7590db;">square</span> <span style="color: #4f97d7; font-weight: bold;">=</span> <span style="color: #ce537a; font-weight: bold;">MagicSquareBuilder</span><span style="color: #4f97d7;">(</span><span style="color: #bc6ec5;">cells</span><span style="color: #4f97d7; font-weight: bold;">=</span>pd.<span style="color: #ce537a; font-weight: bold; font-style: italic;">DataFrame</span><span style="color: #bc6ec5;">(</span>np.<span style="color: #2aa1ae; font-weight: bold; font-style: italic;">zeros</span><span style="color: #2d9574;">(</span><span style="color: #67b11d;">(</span>size, size<span style="color: #67b11d;">)</span>, <span style="color: #bc6ec5;">dtype</span><span style="color: #4f97d7; font-weight: bold;">=</span>int<span style="color: #2d9574;">)</span><span style="color: #bc6ec5;">)</span><span style="color: #4f97d7;">)</span>
    <span style="color: #7590db;">positions</span> <span style="color: #4f97d7; font-weight: bold;">=</span> <span style="color: #4f97d7; font-weight: bold;">list</span><span style="color: #4f97d7;">(</span><span style="color: #bc6ec5;">(</span>r, c<span style="color: #bc6ec5;">)</span> <span style="color: #4f97d7; font-weight: bold;">for</span> <span style="color: #7590db;">r</span> <span style="color: #4f97d7; font-weight: bold;">in</span> <span style="color: #4f97d7; font-weight: bold;">range</span><span style="color: #bc6ec5;">(</span>size<span style="color: #bc6ec5;">)</span> <span style="color: #4f97d7; font-weight: bold;">for</span> <span style="color: #7590db;">c</span> <span style="color: #4f97d7; font-weight: bold;">in</span> <span style="color: #4f97d7; font-weight: bold;">range</span><span style="color: #bc6ec5;">(</span>size<span style="color: #bc6ec5;">)</span><span style="color: #4f97d7;">)</span>
    <span style="color: #7590db;">all_values</span> <span style="color: #4f97d7; font-weight: bold;">=</span> <span style="color: #4f97d7; font-weight: bold;">list</span><span style="color: #4f97d7;">(</span><span style="color: #4f97d7; font-weight: bold;">range</span><span style="color: #bc6ec5;">(</span><span style="color: #a45bad;">1</span>, size<span style="color: #4f97d7; font-weight: bold;">**</span><span style="color: #a45bad;">2</span><span style="color: #4f97d7; font-weight: bold;">+</span><span style="color: #a45bad;">1</span><span style="color: #bc6ec5;">)</span><span style="color: #4f97d7;">)</span>
    <span style="color: #7590db;">square</span> <span style="color: #4f97d7; font-weight: bold;">=</span> <span style="color: #2aa1ae; font-weight: bold;">fill_magic_square</span><span style="color: #4f97d7;">(</span>square, positions, all_values<span style="color: #4f97d7;">)</span>
    <span style="color: #4f97d7; font-weight: bold;">return</span> square <span style="color: #4f97d7; font-weight: bold;">and</span> square.<span style="color: #a45bad; font-style: italic;">cells</span>
</pre>
</div>

<p>
Lets try it
</p>

<div class="org-src-container">
<pre class="src src-python"><span style="color: #4f97d7; font-weight: bold;">print</span><span style="color: #4f97d7;">(</span><span style="color: #2aa1ae; font-weight: bold;">find_magic_square</span><span style="color: #bc6ec5;">(</span><span style="color: #a45bad;">2</span><span style="color: #bc6ec5;">)</span><span style="color: #4f97d7;">)</span> <span style="color: #2aa1ae; background-color: #292e34;"># should be None</span>
<span style="color: #4f97d7; font-weight: bold;">print</span><span style="color: #4f97d7;">(</span><span style="color: #2aa1ae; font-weight: bold;">find_magic_square</span><span style="color: #bc6ec5;">(</span><span style="color: #a45bad;">3</span><span style="color: #bc6ec5;">)</span><span style="color: #4f97d7;">)</span> <span style="color: #2aa1ae; background-color: #292e34;"># sould be a square</span>
</pre>
</div>


<p>
Wahoo that works, its not the most efficient but it does work. Although I notice that it is taking forever and I hit timeouts even on values as low as 4
</p>

<div class="org-src-container">
<pre class="src src-python"><span style="color: #4f97d7; font-weight: bold;">if</span> <span style="color: #4f97d7;">__name__</span> <span style="color: #4f97d7; font-weight: bold;">==</span> <span style="color: #2d9574;">"__main__"</span>:
    <span style="color: #4f97d7; font-weight: bold;">import</span> sys
    <span style="color: #4f97d7; font-weight: bold;">if</span> <span style="color: #4f97d7; font-weight: bold;">len</span><span style="color: #4f97d7;">(</span>sys.<span style="color: #a45bad; font-style: italic;">argv</span><span style="color: #4f97d7;">)</span> <span style="color: #4f97d7; font-weight: bold;">&gt;</span> <span style="color: #a45bad;">1</span>:
        <span style="color: #2aa1ae; font-weight: bold;">find_magic_square</span><span style="color: #4f97d7;">(</span><span style="color: #4f97d7; font-weight: bold;">int</span><span style="color: #bc6ec5;">(</span>sys.<span style="color: #a45bad; font-style: italic;">argv</span><span style="color: #2d9574;">[</span><span style="color: #a45bad;">1</span><span style="color: #2d9574;">]</span><span style="color: #bc6ec5;">)</span><span style="color: #4f97d7;">)</span>
</pre>
</div>

<div class="org-src-container">
<pre class="src src-shell"><span style="color: #2aa1ae; font-weight: bold;">timeout</span> <span style="color: #a45bad;">10s</span> python <span style="color: #4f97d7; font-weight: bold;">$</span><span style="color: #a45bad; font-style: italic;">script_name</span> <span style="color: #a45bad;">4</span> <span style="color: #a45bad;">2</span>&gt;&amp;<span style="color: #a45bad;">1</span>
<span style="color: #4f97d7; font-weight: bold;">echo</span> <span style="color: #4f97d7; font-weight: bold;">$</span><span style="color: #dc752f; background-color: #292b2e;">?</span>
</pre>
</div>

<p>
Ok, so what I did is just too damn slow even for our limited constraints. Perhaps we can try to speed it up. I'm not ready to blame this all on Pandas just yet
</p>
</div>
</div>
