magic-square-generation/README.html
<div id="outline-container-orgbb3ac8e" class="outline-3">
<h3 id="orgbb3ac8e"><span class="section-number-3">3.2.</span> Attempt 2 - Constraint Solver</h3>
<div class="outline-text-3" id="text-3-2">
</div>
<div id="outline-container-org7d9aaed" class="outline-4">
<h4 id="org7d9aaed"><span class="section-number-4">3.2.1.</span> Brainstorming</h4>
<div class="outline-text-4" id="text-3-2-1">
<p>
Lets change the model to one of constraints. Here the idea is that we can fill out rows one at a time
</p>

<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="org-right" />

<col  class="org-left" />

<col  class="org-left" />
</colgroup>
<tbody>
<tr>
<td class="org-right">2</td>
<td class="org-left">&#xa0;</td>
<td class="org-left">&#xa0;</td>
</tr>
</tbody>
</table>

<p>
Well we clearly can answer the remaining set of possibilities: <code>{(1,13),(3,10),(4,9),(5,8),(6,7)}</code> where each pair can go in any order. This can even be cached.
</p>

<p>
Now lets say we get to
</p>

<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="org-right" />

<col  class="org-right" />

<col  class="org-right" />
</colgroup>
<tbody>
<tr>
<td class="org-right">2</td>
<td class="org-right">7</td>
<td class="org-right">6</td>
</tr>

<tr>
<td class="org-right">9</td>
<td class="org-right">&#xa0;</td>
<td class="org-right">&#xa0;</td>
</tr>
</tbody>
</table>

<p>
The possibilities for the row are <code>{(1,5),(2,4)}</code>, and for the column are <code>{(2,6),(3,5)}</code>, for the dialgonal are <code>{(1,13),(3,10),(4,9),(5,8),(6,7)}</code> and for the anti-diagonal are <code>{(1,8),(2,7),(4,5)}</code>. We flatten these sets and take the intersection and only one possiblity remains <code>5</code>. #e can go further and subtract from this the set of already used numbers to narrow it down further
</p>

<p>
Lets try this again but run through it till we hit a dead end. Also for the sake of expediency lets start at a high number
</p>

<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="org-right" />

<col  class="org-left" />

<col  class="org-left" />
</colgroup>
<tbody>
<tr>
<td class="org-right">10</td>
<td class="org-left">&#xa0;</td>
<td class="org-left">&#xa0;</td>
</tr>
</tbody>
</table>

<p>
The remaining possibilities are <code>{(1,4),(2,3)}</code> we don't have anything else to go off of so lets pick that first tuple and fill it out before moving on to the next row. If this doesn't work out we can try out the next later
</p>

<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="org-right" />

<col  class="org-right" />

<col  class="org-right" />
</colgroup>
<tbody>
<tr>
<td class="org-right">10</td>
<td class="org-right">1</td>
<td class="org-right">4</td>
</tr>

<tr>
<td class="org-right">&#xa0;</td>
<td class="org-right">&#xa0;</td>
<td class="org-right">&#xa0;</td>
</tr>
</tbody>
</table>

<p>
The possibilities on the row are all the variants but on the column are once more  <code>{(1,4),(2,3)}</code> so the intersection is those four numbers flattened. Subtracting out the set of already used values we are left with a possibility of <code>{(2,3)}</code>.
</p>

<p>
Not having anything else to go on, lets prefill things in that order but we <b>were</b> just at another decision point.
</p>

<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="org-right" />

<col  class="org-right" />

<col  class="org-right" />
</colgroup>
<tbody>
<tr>
<td class="org-right">10</td>
<td class="org-right">1</td>
<td class="org-right">4</td>
</tr>

<tr>
<td class="org-right">2</td>
<td class="org-right">&#xa0;</td>
<td class="org-right">&#xa0;</td>
</tr>

<tr>
<td class="org-right">3</td>
<td class="org-right">&#xa0;</td>
<td class="org-right">&#xa0;</td>
</tr>
</tbody>
</table>

<p>
Now for the rest of row[1] the possible values are <code>{(1,13),(3,10),(4,9),(5,8),(6,7)}</code>, the possible column values are <code>{(2,12),(3,11),(4,10),(5,9),(6,8)}</code>, the possible diagonals are <code>{(1,4),(2,3)}</code> and anti-diagonals are <code>{(1,10),(2,9),(3,8),(5,6)}</code>. Flatten the and intersect and you get <code>{3}</code>. That's not enough values to fill the row so we've hit a dead end. Lets back it up to the previous decision point
</p>

<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="org-right" />

<col  class="org-right" />

<col  class="org-right" />
</colgroup>
<tbody>
<tr>
<td class="org-right">10</td>
<td class="org-right">1</td>
<td class="org-right">4</td>
</tr>

<tr>
<td class="org-right">3</td>
<td class="org-right">&#xa0;</td>
<td class="org-right">&#xa0;</td>
</tr>

<tr>
<td class="org-right">2</td>
<td class="org-right">&#xa0;</td>
<td class="org-right">&#xa0;</td>
</tr>
</tbody>
</table>

<p>
Now for the rest of row[1] the possible values are <code>{(1,11),(2,10),(4,8),(5,7)}</code>, the possible column values are <code>{(2,12),(3,11),(4,10),(5,9),(6,8)}</code>, the possible diagonals are <code>{(1,4),(2,3)}</code> and anti-diagonals are <code>{(1,10),(2,9),(3,8),(5,6)}</code>. Flatten the and intersect and you get <code>{2}</code>. Once again, that's not enough values to fill the row so we've hit a dead end.
</p>

<p>
Lets try that again but without any pairwise thoughts
</p>

<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="org-right" />

<col  class="org-left" />

<col  class="org-left" />
</colgroup>
<tbody>
<tr>
<td class="org-right">10</td>
<td class="org-left">&#xa0;</td>
<td class="org-left">&#xa0;</td>
</tr>
</tbody>
</table>

<p>
The remaining possibilities are <code>{1,2,3,4}</code> lets pick the first Decision point!
</p>

<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="org-right" />

<col  class="org-right" />

<col  class="org-left" />
</colgroup>
<tbody>
<tr>
<td class="org-right">10</td>
<td class="org-right">1</td>
<td class="org-left">&#xa0;</td>
</tr>
</tbody>
</table>

<p>
The reminaing possibilities are <code>4</code>, there isn't really a decision here for a 3x3 but would be for more
</p>

<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="org-right" />

<col  class="org-right" />

<col  class="org-right" />
</colgroup>
<tbody>
<tr>
<td class="org-right">10</td>
<td class="org-right">1</td>
<td class="org-right">4</td>
</tr>

<tr>
<td class="org-right">&#xa0;</td>
<td class="org-right">&#xa0;</td>
<td class="org-right">&#xa0;</td>
</tr>
</tbody>
</table>

<p>
rows are unconstrained, column is contstrained to <code>{1,2,3,4}</code> subtract out the already used to get <code>{2,3}</code> and pick the first at a decision point
</p>

<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="org-right" />

<col  class="org-right" />

<col  class="org-right" />
</colgroup>
<tbody>
<tr>
<td class="org-right">10</td>
<td class="org-right">1</td>
<td class="org-right">4</td>
</tr>

<tr>
<td class="org-right">2</td>
<td class="org-right">&#xa0;</td>
<td class="org-right">&#xa0;</td>
</tr>
</tbody>
</table>

<p>
the next value is now constrained by row to <code>{1,3,4,5,6,7,8,9,10}</code> and by column to <code>{2,3,4,5,6,7,8,9,10}</code> by diagonal to <code>{1,2,3,4}</code> and by anti-diagonal to <code>{1,2,3,4,5,6,7,8,9,10}</code>. This gives us an intersection of <code>{3,4}</code> and when you subtract all the used ones you get <code>{3}</code>. Dead end!
</p>

<p>
Rolling back to the previous decision point
</p>

<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="org-right" />

<col  class="org-right" />

<col  class="org-right" />
</colgroup>
<tbody>
<tr>
<td class="org-right">10</td>
<td class="org-right">1</td>
<td class="org-right">4</td>
</tr>

<tr>
<td class="org-right">3</td>
<td class="org-right">&#xa0;</td>
<td class="org-right">&#xa0;</td>
</tr>
</tbody>
</table>

<p>
the next value is now constrained by row to <code>{1,2,4,5,6,7,8,9,10}</code> and by column to <code>{2,3,4,5,6,7,8,9,10}</code> by diagonal to <code>{1,2,3,4}</code> and by anti-diagonal to <code>{1,2,3,4,5,6,7,8,9,10}</code>. This gives us an intersection of <code>{2,4}</code> and when you subtract all the used ones you get <code>{2}</code>. Dead end! Our previous decision point was all the way back on position 2
</p>

<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="org-right" />

<col  class="org-right" />

<col  class="org-left" />
</colgroup>
<tbody>
<tr>
<td class="org-right">10</td>
<td class="org-right">2</td>
<td class="org-left">&#xa0;</td>
</tr>
</tbody>
</table>


<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="org-right" />

<col  class="org-right" />

<col  class="org-right" />
</colgroup>
<tbody>
<tr>
<td class="org-right">10</td>
<td class="org-right">2</td>
<td class="org-right">3</td>
</tr>

<tr>
<td class="org-right">&#xa0;</td>
<td class="org-right">&#xa0;</td>
<td class="org-right">&#xa0;</td>
</tr>
</tbody>
</table>

<p>
rows are unconstrained, column is contstrained to <code>{1,2,3,4}</code> subtract out the already used to get <code>{1,4}</code> and pick the first at a decision point
</p>

<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="org-right" />

<col  class="org-right" />

<col  class="org-right" />
</colgroup>
<tbody>
<tr>
<td class="org-right">10</td>
<td class="org-right">2</td>
<td class="org-right">3</td>
</tr>

<tr>
<td class="org-right">1</td>
<td class="org-right">&#xa0;</td>
<td class="org-right">&#xa0;</td>
</tr>
</tbody>
</table>

<p>
the next value is now constrained by row to <code>{2,3,4,5,6,7,8,9,10}</code> and by column to <code>{1,3,4,5,6,7,8,9,10}</code> by diagonal to <code>{1,2,3,4}</code> and by anti-diagonal to <code>{1,2,4,5,6,7,8,9,10}</code>. This gives us an intersection of <code>{2,4}</code> and when you subtract all the used ones you get <code>{4}</code>. Dead end!
</p>

<p>
At this point I am noticing that we're just reflecting the square from above. I guess once we eliminate a set of values for row 1 we could <b>also</b> eliminate them for column 1. This might be like overkill as an optimization for our needs though I'm sure it can halve some runtimes.
</p>

<p>
Ok, we'll do this one more time but on a <code>N=4</code>, <code>4x4</code> square.
</p>

<p>
I'm also going to be really methodical here with making my steps explicit and listing all constraints. Some universal constraints that we will be applying are
</p>
</div>
<ol class="org-ol">
