magic-square-generation/README.org
**** Defining our Constraints
- Known Value :: Must be in \( [1, N^2] = [1,16] \)
- Row Sum :: Ensure the row sum is
    \( S = \frac{N(1+N^2)}{2} = 34 \)
  So when you're on row index =r= and the sum so far is =R=, the bounds will be \( [1, S-R ] \)
  Though we can actually decrease it further any *sum* of the range of cells after =r= must be possible. But the lowest possible sum for a number of cells =k= ...

  - When r=0 there are k=3 left after this one. \( R'=3+2+1=6 \)
  - When r=1 there's k=2 left. \( R'=2+1=3 \)
  - When r=2 there's k=1 left. \( R'=1 \)
  - When r=3 there's k=0 left. \( R'=0 \)
  In this case \( k=N-r-1 \). and \( R'=\frac{k(k+1)}{2} \)

  which we can subsitute in to get
  \begin{equation}
    \frac{(N-r-1)(N-r-1+1)}{2}
    \frac{(N-r-1)(N-r)}{2}
    \\=R'
  \end{equation}

  I think that's the neatest thing we could reduce it to? So we have this equation \( S = R + V[r] + R' \)

  And finally twe get

  \( [1, S-R-R'] \)

  which accounts for the fact that you don't want to sum up *all* the way to =S= before you get to the end.
  **Important Caveat*: If \( r+1=N \) then \( [S-R-R']=[S-R] \) is also the lowerbound
- Column Sum :: Ensure the same for column sum on column index =c= when the sum so far is =C=, the bounds will be \( [1, S-C-C'] \)
- Diagonal Sum :: When \( r=c \), the same for diagonal sum when the sum so far is =D=, the bounds will be \( [1, S-D-D'] \)
- Anti-Diagonal Sum :: When \( r=(N-c-1) \), the same for the anti-diagonal sum when the sum so far is =D_a=, the bounds will be \( [1, S-D_a-D_a'] \)
- Uniqueness :: Must not be one of the numbers already used
- Disallowed :: Values we already tried DFS when searching this decision point

