magic-square-generation/README.html
<li><a id="org0a4e176"></a>Defining our Constraints<br />
<div class="outline-text-5" id="text-3-2-1-1">
<dl class="org-dl">
<dt>Known Value</dt><dd>Must be in \( [1, N^2] = [1,16] \)</dd>
<dt>Row Sum</dt><dd><p>
Ensure the row sum is
  \( S = \frac{N(1+N^2)}{2} = 34 \)
So when you're on row index <code>r</code> and the sum so far is <code>R</code>, the bounds will be \( [1, S-R ] \)
Though we can actually decrease it further any <b>sum</b> of the range of cells after <code>r</code> must be possible. But the lowest possible sum for a number of cells <code>k</code> &#x2026;
</p>

<ul class="org-ul">
<li>If N=4
<ul class="org-ul">
<li>When r=0 there are k=3 left after this one. \( R'=3+2+1=6 \)</li>
<li>When r=1 there's k=2 left. \( R'=2+1=3 \)</li>
<li>When r=2 there's k=1 left. \( R'=1 \)</li>
<li>When r=3 there's k=0 left. \( R'=0 \)</li>
</ul></li>
</ul>
<p>
In this case \( k=N-r-1 \). and \( R'=\frac{k(k+1)}{2} \)
</p>

<p>
which we can subsitute in to get
</p>
\begin{equation}
  \frac{(N-r-1)(N-r-1+1)}{2}
  \frac{(N-r-1)(N-r)}{2}
  \\=R'
\end{equation}

<p>
I think that's the neatest thing we could reduce it to? So we have this equation \( S = R + V[r] + R' \)
</p>

<p>
And finally twe get
</p>

<p>
\( [1, S-R-R'] \)
</p>

<p>
which accounts for the fact that you don't want to sum up <b>all</b> the way to <code>S</code> before you get to the end.
<b>*Important Caveat</b>: If \( r+1=N \) then this range is simply \( [S-R,S-R] \)
</p></dd>
<dt>Column Sum</dt><dd>Ensure the same for column sum on column index <code>c</code> when the sum so far is <code>C</code>, the bounds will be \( [1, S-C-C'] \)</dd>
<dt>Diagonal Sum</dt><dd>When \( r=c \), the same for diagonal sum when the sum so far is <code>D</code>, the bounds will be \( [1, S-D-D'] \)</dd>
<dt>Anti-Diagonal Sum</dt><dd>When \( r=(N-c-1) \), the same for the anti-diagonal sum when the sum so far is <code>D_a</code>, the bounds will be \( [1, S-D_a-D_a'] \)</dd>
<dt>Uniqueness</dt><dd>Must not be one of the numbers already used</dd>
<dt>Disallowed</dt><dd>Values we already tried DFS when searching this decision point</dd>
</dl>
</div>
</li>
