magic-square-generation/README.org
**** 4 Square Sample

At each decision point we will pick the highest number possible. It shouldn't make a lot of difference but we can hopefully use it to cut down on some options.

We are going to move top left to bottom right, backtracking at each decision point as necessary.

| Cell | Row Sum | Column Sum | Diagonal Sum | Anti-diagonal | Uniqueness            | Disallowed | Decision |
|------+---------+------------+--------------+---------------+-----------------------+------------+----------|
| 0 0  | [1,34]  | [1,34]     | [1,34]       |               |                       |            |       16 |
| 0 1  | [1,15]  | [1,34]     |              |               | -{16}                 |            |       15 |
| 0 2  | [1,2]   | [1,34]     |              |               | -{15,16}              |            |        2 |
| 0 3  | [1,1]   | [1,34]     |              | [1,34]        | -{2,15,16}            |            |        1 |
| 1 0  | [1,34]  | [1,15]     |              |               | -{1,2,15,16}          |            |       14 |
| 1 1  | [1,17]  | [1,16]     | [1,15]       |               | -{1,2,[14,16]}        |            |       13 |
| 1 2  | [1,6]   | [1,29]     |              | [1,30]        | -{1,2,[13,16]}        |            |        6 |
| 1 3  | [1,1]   | [1,30]     |              |               | -{1,2,6,[13,16]}      |            |          |
| 1 2  | [1,6]   | [1,29]     |              | [1,30]        | -{1,2,[13,16]}        | -{6}       |        5 |
| 1 3  | [1,2]   | [1,30]     |              |               | -{1,2,5,[13,16]}      |            |          |
| 1 2  | [1,6]   | [1,29]     |              | [1,30]        | -{1,2,[13,16]}        | -{5,6}     |        4 |
| 1 3  | [1,3]   | [1,30]     |              |               | -{1,2,5,[13,16]}      |            |        3 |
| 2 1  | [1,34]  | [1,3]      |              |               | -{[1,3],5,[13,16]}    |            |          |
| 1 3  | [1,3]   | [1,30]     |              |               | -{1,2,5,[13,16]}      | -{3}       |          |
| 1 2  | [1,6]   | [1,29]     |              | [1,30]        | -{1,2,[13,16]}        | -{4,5,6}   |        3 |
| 1 3  | [1,4]   | [1,30]     |              |               | -{[1,3],[13,16]}      |            |        4 |
| 2 1  | [1,34]  | [1,3]      |              |               | -{[1,4],[13,16]}      |            |          |
| 1 3  | [1,4]   | [1,30]     |              |               | -{[1,3],[13,16]}      | -{4}       |          |
| 1 2  | [1,6]   | [1,29]     |              | [1,30]        | -{1,2,[13,16]}        | -{3,4,5,6} |          |
| 1 1  | [1,17]  | [1,16]     | [1,15]       |               | -{1,2,[14,16]}        | -{13}      |       12 |
| 1 2  | [1,7]   | [1,29]     |              | [1,30]        | -{1,2,12,[14,16]}     |            |        7 |
| 1 3  | [1,1]   | [1,30]     |              |               | -{1,2,7,12,[13,16]}   |            |          |
| 1 2  | [1,7]   | [1,29]     |              | [1,30]        | -{1,2,12,[14,16]}     | -{7}       |        6 |
| 1 3  | [1,2]   | [1,30]     |              |               | -{1,2,6,12,[13,16]}   |            |          |
| 1 2  | [1,7]   | [1,29]     |              | [1,30]        | -{1,2,12,[14,16]}     | -{6,7}     |        5 |
| 1 3  | [1,3]   | [1,30]     |              |               | -{1,2,5,12,[13,16]}   |            |        3 |
| 2 1  | [1,34]  | [1,4]      |              |               | -{[1,3],5,12,[14,16]} |            |        4 |
| 2 2  | [1,27]  | [1,4]      |              | [1,27]        | -{[1,5],12,[14,16]}   |            |          |
|      |         |            |              |               |                       |            |          |

| 16 | 15 | 2 | 1 |
| 14 | 12 | 5 | 3 |
|  4 |    |   |   |
|    |    |   |   |

I mean thats quite a few steps, but we have eliminated a good deal of the start-with-16 possibilities relatively quickly.

 I never looked into how constraint solvers are implemented under the hood, but it seems likely that its similar to this

 I also realize that I screwed up the upper bounds above, but thats ok, I think I am understanding the algorithm here

