magic-square-generation/README.html
<li><a id="org48ee63b"></a>4 Square Sample<br />
<div class="outline-text-5" id="text-3-2-1-2">
<p>
At each decision point we will pick the highest number possible. It shouldn't make a lot of difference but we can hopefully use it to cut down on some options.
</p>

<p>
We are going to move top left to bottom right, backtracking at each decision point as necessary.
</p>

<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="org-left" />

<col  class="org-left" />

<col  class="org-left" />

<col  class="org-left" />

<col  class="org-left" />

<col  class="org-left" />

<col  class="org-left" />

<col  class="org-right" />
</colgroup>
<thead>
<tr>
<th scope="col" class="org-left">Cell</th>
<th scope="col" class="org-left">Row Sum</th>
<th scope="col" class="org-left">Column Sum</th>
<th scope="col" class="org-left">Diagonal Sum</th>
<th scope="col" class="org-left">Anti-diagonal</th>
<th scope="col" class="org-left">Uniqueness</th>
<th scope="col" class="org-left">Disallowed</th>
<th scope="col" class="org-right">Decision</th>
</tr>
</thead>
<tbody>
<tr>
<td class="org-left">0 0</td>
<td class="org-left">[1,34]</td>
<td class="org-left">[1,34]</td>
<td class="org-left">[1,34]</td>
<td class="org-left">&#xa0;</td>
<td class="org-left">&#xa0;</td>
<td class="org-left">&#xa0;</td>
<td class="org-right">16</td>
</tr>

<tr>
<td class="org-left">0 1</td>
<td class="org-left">[1,15]</td>
<td class="org-left">[1,34]</td>
<td class="org-left">&#xa0;</td>
<td class="org-left">&#xa0;</td>
<td class="org-left">-{16}</td>
<td class="org-left">&#xa0;</td>
<td class="org-right">15</td>
</tr>

<tr>
<td class="org-left">0 2</td>
<td class="org-left">[1,2]</td>
<td class="org-left">[1,34]</td>
<td class="org-left">&#xa0;</td>
<td class="org-left">&#xa0;</td>
<td class="org-left">-{15,16}</td>
<td class="org-left">&#xa0;</td>
<td class="org-right">2</td>
</tr>

<tr>
<td class="org-left">0 3</td>
<td class="org-left">[1,1]</td>
<td class="org-left">[1,34]</td>
<td class="org-left">&#xa0;</td>
<td class="org-left">[1,34]</td>
<td class="org-left">-{2,15,16}</td>
<td class="org-left">&#xa0;</td>
<td class="org-right">1</td>
</tr>

<tr>
<td class="org-left">1 0</td>
<td class="org-left">[1,34]</td>
<td class="org-left">[1,15]</td>
<td class="org-left">&#xa0;</td>
<td class="org-left">&#xa0;</td>
<td class="org-left">-{1,2,15,16}</td>
<td class="org-left">&#xa0;</td>
<td class="org-right">14</td>
</tr>

<tr>
<td class="org-left">1 1</td>
<td class="org-left">[1,17]</td>
<td class="org-left">[1,16]</td>
<td class="org-left">[1,15]</td>
<td class="org-left">&#xa0;</td>
<td class="org-left">-{1,2,[14,16]}</td>
<td class="org-left">&#xa0;</td>
<td class="org-right">13</td>
</tr>

<tr>
<td class="org-left">1 2</td>
<td class="org-left">[1,6]</td>
<td class="org-left">[1,29]</td>
<td class="org-left">&#xa0;</td>
<td class="org-left">[1,30]</td>
<td class="org-left">-{1,2,[13,16]}</td>
<td class="org-left">&#xa0;</td>
<td class="org-right">6</td>
</tr>

<tr>
<td class="org-left">1 3</td>
<td class="org-left">[1,1]</td>
<td class="org-left">[1,30]</td>
<td class="org-left">&#xa0;</td>
<td class="org-left">&#xa0;</td>
<td class="org-left">-{1,2,6,[13,16]}</td>
<td class="org-left">&#xa0;</td>
<td class="org-right">&#xa0;</td>
</tr>

<tr>
<td class="org-left">1 2</td>
<td class="org-left">[1,6]</td>
<td class="org-left">[1,29]</td>
<td class="org-left">&#xa0;</td>
<td class="org-left">[1,30]</td>
<td class="org-left">-{1,2,[13,16]}</td>
<td class="org-left">-{6}</td>
<td class="org-right">5</td>
</tr>

<tr>
<td class="org-left">1 3</td>
<td class="org-left">[1,2]</td>
<td class="org-left">[1,30]</td>
<td class="org-left">&#xa0;</td>
<td class="org-left">&#xa0;</td>
<td class="org-left">-{1,2,5,[13,16]}</td>
<td class="org-left">&#xa0;</td>
<td class="org-right">&#xa0;</td>
</tr>

<tr>
<td class="org-left">1 2</td>
<td class="org-left">[1,6]</td>
<td class="org-left">[1,29]</td>
<td class="org-left">&#xa0;</td>
<td class="org-left">[1,30]</td>
<td class="org-left">-{1,2,[13,16]}</td>
<td class="org-left">-{5,6}</td>
<td class="org-right">4</td>
</tr>

<tr>
<td class="org-left">1 3</td>
<td class="org-left">[1,3]</td>
<td class="org-left">[1,30]</td>
<td class="org-left">&#xa0;</td>
<td class="org-left">&#xa0;</td>
<td class="org-left">-{1,2,5,[13,16]}</td>
<td class="org-left">&#xa0;</td>
<td class="org-right">3</td>
</tr>

<tr>
<td class="org-left">2 1</td>
<td class="org-left">[1,34]</td>
<td class="org-left">[1,3]</td>
<td class="org-left">&#xa0;</td>
<td class="org-left">&#xa0;</td>
<td class="org-left">-{[1,3],5,[13,16]}</td>
<td class="org-left">&#xa0;</td>
<td class="org-right">&#xa0;</td>
</tr>

<tr>
<td class="org-left">1 3</td>
<td class="org-left">[1,3]</td>
<td class="org-left">[1,30]</td>
<td class="org-left">&#xa0;</td>
<td class="org-left">&#xa0;</td>
<td class="org-left">-{1,2,5,[13,16]}</td>
<td class="org-left">-{3}</td>
<td class="org-right">&#xa0;</td>
</tr>

<tr>
<td class="org-left">1 2</td>
<td class="org-left">[1,6]</td>
<td class="org-left">[1,29]</td>
<td class="org-left">&#xa0;</td>
<td class="org-left">[1,30]</td>
<td class="org-left">-{1,2,[13,16]}</td>
<td class="org-left">-{4,5,6}</td>
<td class="org-right">3</td>
</tr>

<tr>
<td class="org-left">1 3</td>
<td class="org-left">[1,4]</td>
<td class="org-left">[1,30]</td>
<td class="org-left">&#xa0;</td>
<td class="org-left">&#xa0;</td>
<td class="org-left">-{[1,3],[13,16]}</td>
<td class="org-left">&#xa0;</td>
<td class="org-right">4</td>
</tr>

<tr>
<td class="org-left">2 1</td>
<td class="org-left">[1,34]</td>
<td class="org-left">[1,3]</td>
<td class="org-left">&#xa0;</td>
<td class="org-left">&#xa0;</td>
<td class="org-left">-{[1,4],[13,16]}</td>
<td class="org-left">&#xa0;</td>
<td class="org-right">&#xa0;</td>
</tr>

<tr>
<td class="org-left">1 3</td>
<td class="org-left">[1,4]</td>
<td class="org-left">[1,30]</td>
<td class="org-left">&#xa0;</td>
<td class="org-left">&#xa0;</td>
<td class="org-left">-{[1,3],[13,16]}</td>
<td class="org-left">-{4}</td>
<td class="org-right">&#xa0;</td>
</tr>

<tr>
<td class="org-left">1 2</td>
<td class="org-left">[1,6]</td>
<td class="org-left">[1,29]</td>
<td class="org-left">&#xa0;</td>
<td class="org-left">[1,30]</td>
<td class="org-left">-{1,2,[13,16]}</td>
<td class="org-left">-{3,4,5,6}</td>
<td class="org-right">&#xa0;</td>
</tr>

<tr>
<td class="org-left">1 1</td>
<td class="org-left">[1,17]</td>
<td class="org-left">[1,16]</td>
<td class="org-left">[1,15]</td>
<td class="org-left">&#xa0;</td>
<td class="org-left">-{1,2,[14,16]}</td>
<td class="org-left">-{13}</td>
<td class="org-right">12</td>
</tr>

<tr>
<td class="org-left">1 2</td>
<td class="org-left">[1,7]</td>
<td class="org-left">[1,29]</td>
<td class="org-left">&#xa0;</td>
<td class="org-left">[1,30]</td>
<td class="org-left">-{1,2,12,[14,16]}</td>
<td class="org-left">&#xa0;</td>
<td class="org-right">7</td>
</tr>

<tr>
<td class="org-left">1 3</td>
<td class="org-left">[1,1]</td>
<td class="org-left">[1,30]</td>
<td class="org-left">&#xa0;</td>
<td class="org-left">&#xa0;</td>
<td class="org-left">-{1,2,7,12,[13,16]}</td>
<td class="org-left">&#xa0;</td>
<td class="org-right">&#xa0;</td>
</tr>

<tr>
<td class="org-left">1 2</td>
<td class="org-left">[1,7]</td>
<td class="org-left">[1,29]</td>
<td class="org-left">&#xa0;</td>
<td class="org-left">[1,30]</td>
<td class="org-left">-{1,2,12,[14,16]}</td>
<td class="org-left">-{7}</td>
<td class="org-right">6</td>
</tr>

<tr>
<td class="org-left">1 3</td>
<td class="org-left">[1,2]</td>
<td class="org-left">[1,30]</td>
<td class="org-left">&#xa0;</td>
<td class="org-left">&#xa0;</td>
<td class="org-left">-{1,2,6,12,[13,16]}</td>
<td class="org-left">&#xa0;</td>
<td class="org-right">&#xa0;</td>
</tr>

<tr>
<td class="org-left">1 2</td>
<td class="org-left">[1,7]</td>
<td class="org-left">[1,29]</td>
<td class="org-left">&#xa0;</td>
<td class="org-left">[1,30]</td>
<td class="org-left">-{1,2,12,[14,16]}</td>
<td class="org-left">-{6,7}</td>
<td class="org-right">5</td>
</tr>

<tr>
<td class="org-left">1 3</td>
<td class="org-left">[1,3]</td>
<td class="org-left">[1,30]</td>
<td class="org-left">&#xa0;</td>
<td class="org-left">&#xa0;</td>
<td class="org-left">-{1,2,5,12,[13,16]}</td>
<td class="org-left">&#xa0;</td>
<td class="org-right">3</td>
</tr>

<tr>
<td class="org-left">2 1</td>
<td class="org-left">[1,34]</td>
<td class="org-left">[1,4]</td>
<td class="org-left">&#xa0;</td>
<td class="org-left">&#xa0;</td>
<td class="org-left">-{[1,3],5,12,[14,16]}</td>
<td class="org-left">&#xa0;</td>
<td class="org-right">4</td>
</tr>

<tr>
<td class="org-left">2 2</td>
<td class="org-left">[1,27]</td>
<td class="org-left">[1,4]</td>
<td class="org-left">&#xa0;</td>
<td class="org-left">[1,27]</td>
<td class="org-left">-{[1,5],12,[14,16]}</td>
<td class="org-left">&#xa0;</td>
<td class="org-right">&#xa0;</td>
</tr>

<tr>
<td class="org-left">&#xa0;</td>
<td class="org-left">&#xa0;</td>
<td class="org-left">&#xa0;</td>
<td class="org-left">&#xa0;</td>
<td class="org-left">&#xa0;</td>
<td class="org-left">&#xa0;</td>
<td class="org-left">&#xa0;</td>
<td class="org-right">&#xa0;</td>
</tr>
</tbody>
</table>

<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="org-right" />

<col  class="org-right" />

<col  class="org-right" />

<col  class="org-right" />
</colgroup>
<tbody>
<tr>
<td class="org-right">16</td>
<td class="org-right">15</td>
<td class="org-right">2</td>
<td class="org-right">1</td>
</tr>

<tr>
<td class="org-right">14</td>
<td class="org-right">12</td>
<td class="org-right">5</td>
<td class="org-right">3</td>
</tr>

<tr>
<td class="org-right">4</td>
<td class="org-right">&#xa0;</td>
<td class="org-right">&#xa0;</td>
<td class="org-right">&#xa0;</td>
</tr>

<tr>
<td class="org-right">&#xa0;</td>
<td class="org-right">&#xa0;</td>
<td class="org-right">&#xa0;</td>
<td class="org-right">&#xa0;</td>
</tr>
</tbody>
</table>

<p>
I mean thats quite a few steps, but we have eliminated a good deal of the start-with-16 possibilities relatively quickly.
</p>

<p>
I never looked into how constraint solvers are implemented under the hood, but it seems likely that its similar to this
</p>

<p>
I also realize that I screwed up the upper bounds above, but thats ok, I think I am understanding the algorithm here
</p>
</div>
</li>
